Autodesk.Navisworks.Api.Transform3D
A generic transformation in 3D space.

Autodesk.Navisworks.Api.Transform3D.#ctor
Default constructor. Makes an Identity transform.

Autodesk.Navisworks.Api.Transform3D.#ctor(Autodesk.Navisworks.Api.Matrix3,Autodesk.Navisworks.Api.Vector3D)
Make a transform from a matrix and a vector.
Throws System.ArgumentNullException:
Argument 'linear' is null
Throws System.ArgumentException:
Argument 'linear' has been Disposed
Throws System.ArgumentNullException:
Argument 'trans' is null
Throws System.ArgumentException:
Argument 'trans' has been Disposed

Autodesk.Navisworks.Api.Transform3D.#ctor(Autodesk.Navisworks.Api.Rotation3D)
Make a transform from a rotation (3D homogenous).
Throws System.ArgumentNullException:
Argument 'rotation' is null
Throws System.ArgumentException:
Argument 'rotation' has been Disposed

Autodesk.Navisworks.Api.Transform3D.#ctor(Autodesk.Navisworks.Api.Rotation3D,Autodesk.Navisworks.Api.Vector3D)
Make a transform from a rotation and a translation.
Throws System.ArgumentNullException:
Argument 'rotation' is null
Throws System.ArgumentException:
Argument 'rotation' has been Disposed
Throws System.ArgumentNullException:
Argument 'translation' is null
Throws System.ArgumentException:
Argument 'translation' has been Disposed

Autodesk.Navisworks.Api.Transform3D.#ctor(Autodesk.Navisworks.Api.Transform3D)
Make a transform from another transform.
Throws System.ArgumentNullException:
Argument 'transform' is null
Throws System.ArgumentException:
Argument 'transform' has been Disposed

Autodesk.Navisworks.Api.Transform3D.CreateIdentity
Create an identity transform.

Autodesk.Navisworks.Api.Transform3D.CreateTranslation(Autodesk.Navisworks.Api.Vector3D)
Set matrix to be 3D homogenous translation matrix.
Throws System.ArgumentNullException:
Argument 'translation' is null
Throws System.ArgumentException:
Argument 'translation' has been Disposed

Autodesk.Navisworks.Api.Transform3D.Equals(System.Object)
Determines whether the specified object and the current object refer to the same
underlying native object. Returns false if either object has been disposed.

Autodesk.Navisworks.Api.Transform3D.Factor
Treat as homogenous 3D matrix and factor into scale orientation, scale, rotation and translation components.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Transform3D.Factor(Autodesk.Navisworks.Api.Vector3D)
Treat as homogenous 3D matrix and factor into scale orientation, scale, rotation and translation components.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'worldCenter' is null
Throws System.ArgumentException:
Argument 'worldCenter' has been Disposed

Autodesk.Navisworks.Api.Transform3D.GetHashCode
Serves as a hash function for a particular type.  is suitable for use in hashing algorithms and data structures like a hash table.
Returns: A hash code for the current .

Autodesk.Navisworks.Api.Transform3D.Inverse
Return inverse of matrix. Matrix must be non-singular (non-zero determinant).
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Transform3D.IsAffine
Determines if the transform is affine.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Transform3D.IsIdentity
Determines if the transform is an identity.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Transform3D.IsLinear
Determines if the transform is linear.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Transform3D.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.Transform3D.IsRotation
Determines if the transform is a rotation.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Transform3D.IsTranslation
Determines if the transform is a translation.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Transform3D.IsUniformScale
Determines if the transform is a uniform scaling.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Transform3D.Linear
Get parts of matrix which represent orthogonal transforms.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Transform3D.Multiply(Autodesk.Navisworks.Api.Transform3D,Autodesk.Navisworks.Api.Transform3D)
Multiply two transforms in the order that the arguments are given, and return the result.
Throws System.ArgumentNullException:
Argument 'leftTransform' is null
Throws System.ArgumentException:
Argument 'leftTransform' has been Disposed
Throws System.ArgumentNullException:
Argument 'rightTransform' is null
Throws System.ArgumentException:
Argument 'rightTransform' has been Disposed

Autodesk.Navisworks.Api.Transform3D.TolerantEquals(Autodesk.Navisworks.Api.Transform3D)
Equal within a tolerance. Each element of matrix is equal to corresponding element, within the given tolerance.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'transform' is null
Throws System.ArgumentException:
Argument 'transform' has been Disposed

Autodesk.Navisworks.Api.Transform3D.TolerantEquals(Autodesk.Navisworks.Api.Transform3D,System.Double)
Equal within a tolerance. Each element of matrix is equal to corresponding element, within the given tolerance.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'transform' is null
Throws System.ArgumentException:
Argument 'transform' has been Disposed

Autodesk.Navisworks.Api.Transform3D.ToString
Returns a  that represents the current .
Returns: A  that represents the current .

Autodesk.Navisworks.Api.Transform3D.TranslateRight(Autodesk.Navisworks.Api.Vector3D,Autodesk.Navisworks.Api.Transform3D)
Translate a transform by a vector.
Throws System.ArgumentNullException:
Argument 'translation' is null
Throws System.ArgumentException:
Argument 'translation' has been Disposed
Throws System.ArgumentNullException:
Argument 'transform' is null
Throws System.ArgumentException:
Argument 'transform' has been Disposed

Autodesk.Navisworks.Api.Transform3D.Translation
Get parts of matrix which represent the translation.
Throws System.ObjectDisposedException:
Object has been Disposed